snlkuharlocal/src/Documents/Посылка/Посылка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Посылка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПосылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержимое</name>
    <attributes>
      <name>ЛистНабора</name>
      <type>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказовВЛНПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказовВЛНФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/Посылка/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если ОбменДанными.Загрузка=Истина тогда Возврат;КонецЕсли;
	
	если ЭтоНовый() тогда
		если не ЗначениеЗаполнено(Автор) тогда
			Автор=ПараметрыСеанса.Пользователь;
		КонецЕсли;	
		если не ЗначениеЗаполнено(ШКПосылки) тогда
			ШКПосылки="pack"+Номер;
		КонецЕсли;
		
		если не ЗначениеЗаполнено(номер) тогда
			УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	если Модифицированность() тогда
		РасчитатьКоличествоВЛН();
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчитатьКоличествоВЛН ()  экспорт
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.НомерЗаказа) КАК КоличествоЗаказов,
	              |	ЛистПереукладки.ДокОснование КАК Документ
	              |ИЗ
	              |	Документ.ЛистПереукладки КАК ЛистПереукладки
	              |ГДЕ
	              |	ЛистПереукладки.Дата > &Дата
	              |	И ЛистПереукладки.Проведен
	              |	И ЛистПереукладки.НомерЗаказа <> """"
	              |	И ЛистПереукладки.ДокОснование в (&Документ)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЛистПереукладки.ДокОснование";
	
	 запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());	 
	 запрос.УстановитьПараметр("Документ",Содержимое.ВыгрузитьКолонку("Документ"));
	 
	 ТЗПлан=запрос.Выполнить().Выгрузить();
	 ТЗФакт=Содержимое.Выгрузить(,"Документ,НомерЗаказа");
	 ТЗФакт.Свернуть("Документ,НомерЗаказа");
	 
	 Для каждого СтрТЧ из Содержимое цикл
		СтрТЗПлан=ТЗПлан.Найти(СтрТЧ.Документ,"Документ");
		если СтрТЗПлан<>Неопределено тогда
			СтрТЧ.ЗаказовВЛНПлан=СтрТЗПлан.КоличествоЗаказов;
		иначе
			СтрТЧ.ЗаказовВЛНПлан=0;
		КонецЕсли;
		
		
		СтрТЧ.ЗаказовВЛНФакт=ТЗФакт.НайтиСтроки(новый Структура("Документ",СтрТЧ.Документ)).Количество();

		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Содержимое.Очистить();
	Автор=ПараметрыСеанса.Пользователь;
КонецПроцедуры
